
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>操作系统是什么？ · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter active" data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    操作系统是什么？
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >操作系统是什么？</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x524D;&#x8A00;">&#x524D;&#x8A00;</h1>
<p>&#x53EF;&#x4EE5;&#x8BF4;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7ECF;&#x5386;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#x5E74;&#x7684;&#x6F14;&#x53D8;&#xFF0C;&#x6210;&#x4E86;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x7684;&#x5C42;&#x5C42;&#x5305;&#x88F9;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x5BFC;&#x81F4;&#x5B66;&#x4E60;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x7684;&#x8D39;&#x529B;&#x3002;&#x4E3A;&#x4E86;&#x7406;&#x6E05;&#x8FD9;&#x4E2A;&#x7ED3;&#x6784;&#xFF0C;&#x4E8E;&#x662F;&#x5199;&#x4E86;&#x8FD9;&#x4E00;&#x7BC7;&#x603B;&#x7ED3;&#x3002;&#x6587;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x6211;&#x81EA;&#x5DF1;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x5E76;&#x975E;&#x6743;&#x5A01;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x6240;&#x4EE5;&#x80AF;&#x5B9A;&#x6709;&#x8BB8;&#x8BB8;&#x591A;&#x591A;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x6BD5;&#x7ADF;&#x5728;&#x5199;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x8FDE;&#x4E00;&#x672C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x4E66;&#x90FD;&#x8FD8;&#x6CA1;&#x6709;&#x770B;&#x3002;&#x6587;&#x7AE0;&#x7684;&#x7ED3;&#x6784;&#x5C06;&#x4ECE;&#x6700;&#x5E95;&#x5C42;&#x7684;&#x786C;&#x4EF6;&#x8BF4;&#x8D77;&#xFF0C;&#x76F4;&#x5230;&#x73B0;&#x5728;&#x7528;&#x6237;&#x4F7F;&#x7528;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3002;</p>
<h1 id="&#x4E00;-&#x786C;&#x4EF6;">&#x4E00;. &#x786C;&#x4EF6;</h1>
<p>&#x786C;&#x4EF6;&#x662F;&#x786C;&#x4EF6;&#x8BBE;&#x8BA1;&#x8005;&#x8BBE;&#x8BA1;&#x7684;&#xFF0C;&#x5B83;&#x7684;&#x8BBE;&#x8BA1;&#x65B9;&#x6CD5;&#x4E0E;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x5173;&#x7CFB;&#x4E0D;&#x5927;&#x3002;&#x6BCF;&#x4E2A;&#x786C;&#x4EF6;&#x90FD;&#x53EF;&#x4EE5;&#x4E00;&#x4E9B;&#x5177;&#x4F53;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x5982;&#x663E;&#x5361;&#x53EF;&#x4EE5;&#x5C06;&#x4FE1;&#x606F;&#x663E;&#x793A;&#x5728;&#x5C4F;&#x5E55;&#x4E0A;&#xFF1B;&#x7F51;&#x5361;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x7535;&#x8111;&#x7684;&#x8054;&#x7F51;&#xFF1B;&#x58F0;&#x5361;&#x53EF;&#x4EE5;&#x8BA9;&#x7535;&#x8111;&#x53D1;&#x51FA;&#x58F0;&#x97F3;&#x7B49;&#x7B49;&#x2026;&#x2026;
&#x53EF;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x786C;&#x4EF6;&#x7684;&#x5F80;&#x5F80;&#x5176;&#x4E2D;&#x7684;&#x4FE1;&#x606F;&#x662F;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x5982;&#x4F55;&#x624D;&#x80FD;&#x64CD;&#x7EB5;&#x786C;&#x4EF6;&#x5B9E;&#x73B0;&#x7528;&#x6237;&#x60F3;&#x8BA9;&#x5B83;&#x5B9E;&#x73B0;&#x7684;&#x529F;&#x80FD;&#x5462;&#xFF1F;&#x8FD9;&#x4E2A;&#x7B54;&#x6848;&#x5C31;&#x662F;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x3002;</p>
<h1 id="&#x4E8C;-&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;">&#x4E8C;. &#x9A71;&#x52A8;&#x7A0B;&#x5E8F;</h1>
<p>&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x7684;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x6682;&#x65F6;&#x4E0D;&#x7BA1;&#x3002;&#x901A;&#x8FC7;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x5C31;&#x53EF;&#x4EE5;&#x64CD;&#x63A7;&#x786C;&#x4EF6;&#x5B9E;&#x73B0;&#x4E00;&#x4E9B;&#x529F;&#x80FD;&#x3002;
&#x5047;&#x8BBE;&#x73B0;&#x5728;&#x8FD8;&#x6CA1;&#x6709;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x6211;&#x4EEC;&#x65E5;&#x5E38;&#x4F7F;&#x7528;&#x7684;&#x8F6F;&#x4EF6;&#x5C31;&#x662F;&#x901A;&#x8FC7;&#x8C03;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x6765;&#x5B9E;&#x73B0;&#x8C03;&#x7528;&#x786C;&#x4EF6;&#x5B8C;&#x6210;&#x529F;&#x80FD;&#x7684;&#x3002;
&#x53EF;&#x662F;&#x51E0;&#x4E4E;&#x6BCF;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x786C;&#x4EF6;&#x90FD;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x60F3;&#x8981;&#x517C;&#x5BB9;&#x6240;&#x6709;&#x4EBA;&#x7684;&#x7535;&#x8111;&#xFF0C;&#x90A3;&#x8FD9;&#x4E2A;&#x8F6F;&#x4EF6;&#x5C31;&#x5F97;&#x9488;&#x5BF9;&#x6BCF;&#x4E00;&#x4E2A;&#x786C;&#x4EF6;&#x7684;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x7F16;&#x5199;&#x4E0D;&#x540C;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x6CD5;&#xFF0C;&#x6216;&#x8005;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x6765;&#x5339;&#x914D;&#x4E0D;&#x540C;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x8FD9;&#x4E2A;&#x5DE5;&#x4F5C;&#x91CF;&#x6BEB;&#x65E0;&#x7591;&#x95EE;&#x662F;&#x5DE8;&#x5927;&#x7684;&#x3002;
&#x800C;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x5F15;&#x5165;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3002;</p>
<p><img src="https://user-images.githubusercontent.com/91216205/185748847-1e6175f8-f91e-4b1e-b0ea-b72de33a43dd.png" alt="&#x8F6F;&#x4EF6;&#x9002;&#x5E94;&#x6BCF;&#x4E2A;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;">
<img src="https://user-images.githubusercontent.com/91216205/185748862-cb7bd146-daeb-4698-8bf5-a4beef6e453e.png" alt="&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x9002;&#x5E94;&#x6BCF;&#x4E2A;&#x8F6F;&#x4EF6;"></p>
<h1 id="&#x4E09;-&#x5185;&#x6838;">&#x4E09;. &#x5185;&#x6838;</h1>
<p>&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x5185;&#x6838;&#x5C31;&#x662F;&#x7528;&#x6765;&#x7BA1;&#x7406;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x53CA;&#x786C;&#x4EF6;&#x7684;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x3002;&#x5185;&#x6838;&#x9996;&#x5148;&#x5411;&#x786C;&#x4EF6;&#x5F00;&#x53D1;&#x5546;&#x63D0;&#x4F9B;&#x63A5;&#x53E3;&#xFF0C;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x7EDF;&#x4E00;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x786C;&#x4EF6;&#x5F00;&#x53D1;&#x5546;&#x53EA;&#x9700;&#x8981;&#x6839;&#x636E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5185;&#x6838;&#x7684;&#x4E0D;&#x540C;&#x6765;&#x7F16;&#x5199;&#x4E0D;&#x540C;&#x7684;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#xFF0C;&#x800C;&#x73B0;&#x5728;&#x5E02;&#x9762;&#x4E0A;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E5F;&#x6CA1;&#x6709;&#x51E0;&#x4E2A;&#xFF0C;&#x5DE5;&#x4F5C;&#x91CF;&#x53EF;&#x4EE5;&#x8BF4;&#x5E76;&#x4E0D;&#x5927;&#x3002;&#x73B0;&#x5728;&#x5185;&#x6838;&#x5C31;&#x6210;&#x4E86;&#x64CD;&#x4F5C;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x7684;&#x4E2D;&#x8F6C;&#x7AD9;&#x3002;
&#x53EF;&#x662F;&#x8FD9;&#x8FD8;&#x4E0D;&#x591F;&#xFF0C;&#x5BF9;&#x4E8E;&#x8F6F;&#x4EF6;&#x5236;&#x4F5C;&#x8005;&#x6765;&#x8BF4;&#xFF0C;&#x8FD8;&#x662F;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x5185;&#x6838;&#x64CD;&#x4F5C;&#x4E0D;&#x540C;&#x7684;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#xFF0C;&#x9664;&#x4E86;&#x591A;&#x4E86;&#x4E00;&#x5C42;&#x4E2D;&#x4ECB;&#xFF0C;&#x5B9E;&#x9645;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x5E76;&#x6CA1;&#x6709;&#x51CF;&#x8F7B;&#x591A;&#x5C11;&#x3002;
&#x4E8E;&#x662F;&#x5C31;&#x6709;&#x4E86;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x51FA;&#x73B0;&#x3002;</p>
<h1 id="&#x56DB;-&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;">&#x56DB;. &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;</h1>
<p>&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5C06;&#x786C;&#x4EF6;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x7684;&#x63A5;&#x53E3;&#x62BD;&#x8C61;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x4E2A;&#x7684;&#x51FD;&#x6570;&#x63A5;&#x53E3;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x6210;&#x529F;&#x7ED9;&#x8F6F;&#x4EF6;&#x5236;&#x4F5C;&#x8005;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x957F;&#x671F;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x7684;&#x7CFB;&#x7EDF;&#x63A5;&#x53E3;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#xFF0C;&#x4ED6;&#x53EA;&#x9700;&#x8981;&#x5BF9;&#x4E0D;&#x540C;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x4E0D;&#x540C;&#x7248;&#x672C;&#x7684;&#x8F6F;&#x4EF6;&#x5C31;&#x884C;&#x4E86;&#x3002;
<img src="https://user-images.githubusercontent.com/91216205/185748887-432136c8-de3a-42f2-9cce-38404102075c.png" alt="&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;"></p>
<h1 id="&#x603B;&#x7ED3;">&#x603B;&#x7ED3;</h1>
<p>&#x901A;&#x8FC7;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x7B80;&#x5316;&#x4E86;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x7F16;&#x5199;&#x8005;&#x6216;&#x8005;&#x5E94;&#x7528;&#x8F6F;&#x4EF6;&#x7F16;&#x5199;&#x8005;&#x7684;&#x5DE5;&#x4F5C;&#x3002;
&#x73B0;&#x5728;&#x6240;&#x8BF4;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E00;&#x822C;&#x5305;&#x62EC;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x5728;&#x5185;&#xFF0C;&#x8FD8;&#x6709;&#x5185;&#x6838;&#x548C;&#x63D0;&#x4F9B;&#x7ED9;&#x8F6F;&#x4EF6;&#x7684;&#x7F16;&#x7A0B;&#x63A5;&#x53E3;&#x3002;&#x7531;&#x4E8E;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x662F;&#x9700;&#x8981;&#x5D4C;&#x5165;&#x5230;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x91CC;&#x9762;&#xFF0C;&#x8FD9;&#x5C31;&#x8981;&#x6C42;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E0D;&#x4EC5;&#x9700;&#x8981;&#x719F;&#x6089;&#x624B;&#x5934;&#x786C;&#x4EF6;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#xFF0C;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#x5B83;&#x4EEC;&#x8981;&#x786E;&#x4FDD;&#x5B83;&#x4EEC;&#x5199;&#x7684;&#x9A71;&#x52A8;&#x80FD;&#x591F;&#x5D4C;&#x5165;&#x5230;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x91CC;&#x9762;&#x53BB;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"操作系统是什么？","level":"1.1","depth":1,"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"README.md","mtime":"2022-09-05T08:36:44.334Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-09-05T08:37:26.124Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

